// Обработчик запросов метода GET ресурса /tasks_user
//	сервиса oas_api
// 
// В метод передается структура контекста входящего запроса (см. оас_Контекст), содержащая 
// 	Сервис - Строка - БазовыйURL запроса, равен КорневойURL сервиса
// 	Метод - Строка - HTTPМетод
// 	Ресурс - Строка - ОтносительныйURL запроса
// 	Точка - Строка - Ресурс спецификации (user/{username}, /order/{orderId}/update)
// 	Параметры - Соответствие - полученные по спецификации параметры
// 		<Ключ> - Строка - имя параметра
// 		Значение - Строка, Число - значение параметра
// 	Тело - Строка, ДвоичныеДанные - полученное по спецификации тело запроса
// 	Обработчик - Соответствие - полное имя и вызываемы метод обработчика ресурса по настройкам
// 		Имя - Строка - полное имя обработки
// 		Метод - Строка - имя вызываемого метода
// 
// BSLLS:NestedFunctionInParameters-off - без лишних переменных выполнение быстрее
// BSLLS:EmptyRegion-off - пустые области разрешены

#Область ОписаниеПеременных

#КонецОбласти


#Область ПрограммныйИнтерфейс

// Возвращает ответ по запросу GET ресурса /tasks_user
//	сервиса oas_api
//
// Параметры: 
//	guidUser - Строка - Обязательный, 
// 
// Тело запроса:
//	Текст, необязательное
//
// Возвращаемое значение: 
//	HTTPСервисОтвет 
// Схема ответа:
//	{
//		"200": {
//			"description": "OK",
//			"content": {
//				"application/json": {
//					"schema": {
//						"type": "array",
//						"items": {
//							"type": "object",
//							"properties": {
//								"date": {
//									"type": "string",
//									"format": "date-time"
//								},
//								"title": {
//									"type": "string"
//								},
//								"condition": {
//									"type": "string",
//									"description": "Состояние",
//									"enum": [
//										"appointed",
//										"received",
//										"progress",
//										"postponed",
//										"completed",
//										"resumed"
//									]
//								},
//								"importance": {
//									"type": "string",
//									"description": "Важность",
//									"enum": [
//										"base",
//										"low",
//										"high"
//									]
//								},
//								"partner": {
//									"description": "Ссылка на справочник",
//									"type": "object",
//									"properties": {
//										"guid": {
//											"type": "string",
//											"description": "Уникальный идентификатор"
//										},
//										"type": {
//											"type": "string",
//											"description": "Тип справочника"
//										},
//										"name": {
//											"type": "string",
//											"description": "Наименование справочника"
//										},
//										"code": {
//											"type": "string",
//											"description": "Код справочника"
//										}
//									}
//								},
//								"author": {
//									"description": "Ссылка на справочник",
//									"type": "object",
//									"properties": {
//										"guid": {
//											"type": "string",
//											"description": "Уникальный идентификатор"
//										},
//										"type": {
//											"type": "string",
//											"description": "Тип справочника"
//										},
//										"name": {
//											"type": "string",
//											"description": "Наименование справочника"
//										},
//										"code": {
//											"type": "string",
//											"description": "Код справочника"
//										}
//									}
//								},
//								"responsible": {
//									"description": "Ссылка на справочник",
//									"type": "object",
//									"properties": {
//										"guid": {
//											"type": "string",
//											"description": "Уникальный идентификатор"
//										},
//										"type": {
//											"type": "string",
//											"description": "Тип справочника"
//										},
//										"name": {
//											"type": "string",
//											"description": "Наименование справочника"
//										},
//										"code": {
//											"type": "string",
//											"description": "Код справочника"
//										}
//									}
//								},
//								"producer": {
//									"description": "Ссылка на справочник",
//									"type": "object",
//									"properties": {
//										"guid": {
//											"type": "string",
//											"description": "Уникальный идентификатор"
//										},
//										"type": {
//											"type": "string",
//											"description": "Тип справочника"
//										},
//										"name": {
//											"type": "string",
//											"description": "Наименование справочника"
//										},
//										"code": {
//											"type": "string",
//											"description": "Код справочника"
//										}
//									}
//								}
//							},
//							"description": "Элемент журнала задач"
//						}
//					}
//				}
//			}
//		}
//	}
//
Функция Ответ(Контекст) Экспорт
	
	Результат	= Неопределено;
	
	// Допустимы вызовы ТОЛЬКО в серверном контексте
	#Если Сервер Тогда
		
		Результат	= оас_Сервис.ПротоколОтвет(200);
		Тело		= оас_Контекст.Тело(Контекст);
		// Разворачиваем параметры в локальные переменные 
		Параметры	= оас_Контекст.Параметры(Контекст); 
		_guidUser = Параметры.Получить("guidUser");
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	АН_Событие.Ссылка КАК Ссылка,
		|	АН_Событие.Номер КАК Номер,
		|	АН_Событие.Дата КАК Дата,
		|	АН_Событие.Важность КАК Важность,
		|	АН_Событие.ОписаниеСобытия КАК ОписаниеСобытия,
		|	АН_Событие.ПостановщикЗадачи КАК ПостановщикЗадачи,
		|	АН_Событие.Автор КАК Автор,
		|	АН_Событие.Состояние КАК Состояние,
		|	АН_Событие.Ответственный КАК Ответственный,
		|	АН_Событие.Партнер КАК Партнер
		|ИЗ
		|	Документ.АН_Событие КАК АН_Событие
		|ГДЕ
		|	АН_Событие.Ответственный = &Ответственный
		|	И АН_Событие.Состояние <> &СостояниеЗавершено";
		
		
		Запрос.Параметры.Вставить("Ответственный",oas_anit.ВернутьСправочникПоGuid("Пользователи",_guidUser));
		Запрос.Параметры.Вставить("СостояниеЗавершено",Перечисления.АН_СостоянияСобытия.Завершено);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Массив = Новый Массив;
		Пока Выборка.Следующий() Цикл
			Структура = Новый Структура();
			Структура.Вставить("guid",СокрЛП(Выборка.Ссылка.УникальныйИдентификатор()));
			Структура.Вставить("date",Выборка.Ссылка.Дата);
			Структура.Вставить("number",Выборка.Ссылка.Номер);
			Структура.Вставить("condition",oas_anit.ВернутьСтруктуруПеречисления(Выборка.Состояние));
			Структура.Вставить("importance",oas_anit.ВернутьСтруктуруПеречисления(Выборка.Важность));
			Структура.Вставить("title",Выборка.ОписаниеСобытия);
			
			Структура.Вставить("partner",oas_anit.ВернутьСтруктуруСсылкиСправочника(Выборка.Партнер));
			Структура.Вставить("author",oas_anit.ВернутьСтруктуруСсылкиСправочника(Выборка.Автор));
			Структура.Вставить("responsible",oas_anit.ВернутьСтруктуруСсылкиСправочника(Выборка.Ответственный));
			Структура.Вставить("producer",oas_anit.ВернутьСтруктуруСсылкиСправочника(Выборка.ПостановщикЗадачи));
						
			Массив.Добавить(Структура);
		КонецЦикла;
		

		CтрокаJSON = oas_anit.СтруктуруВjSON(Массив);
		Результат.УстановитьТелоИзСтроки(CтрокаJSON,КодировкаТекста.UTF8);

	
		
	#Иначе
		ВызватьИсключение оас_ПодсистемаТексты.СредаВыполненияОшибка();
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции // Ответ 

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#КонецОбласти

// BSLLS:EmptyRegion-on
// BSLLS:NestedFunctionInParameters-on