Функция ПрочитатьСтрокуJSON(СтрокаJSON) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON(); 
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON); 
	Структура = ПрочитатьJSON(ЧтениеJSON); 
	ЧтениеJSON.Закрыть();
	Возврат Структура;
КонецФункции

Функция СтруктуруВjSON(Структура) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи =  Новый ПараметрыЗаписиJSON( , Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);  
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписатьJSON(ЗаписьJSON, Структура,НастройкиСериализации);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ВернутьСправочникПоGuid(ВидСправочника,guid) Экспорт
	НовыйGUID = Новый УникальныйИдентификатор(guid);
	Возврат  Справочники[ВидСправочника].ПолучитьСсылку(Новый УникальныйИдентификатор(guid));
КонецФункции

Функция ВернутьДокументПоGuid(ВидДокумента,guid) Экспорт
	НовыйGUID = Новый УникальныйИдентификатор(guid);
	Возврат  Документы[ВидДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(guid));
КонецФункции

Функция ВернутьСтруктуруСсылкиСправочника(Ссылка) Экспорт
	Структура = Новый Структура;
	Структура.Вставить("type",Ссылка.Метаданные().Имя);
	Структура.Вставить("guid",СокрЛП(Ссылка.УникальныйИдентификатор()));
	Структура.Вставить("code",СокрЛП(Ссылка.Код));
	Структура.Вставить("name",СокрЛП(Ссылка.Наименование));
	
	Возврат Структура;
КонецФункции

Функция СправочникПоСтруктуре(Структура) Экспорт
	Возврат  Справочники[Структура.type].ПолучитьСсылку(Новый УникальныйИдентификатор(Структура.guid));
КонецФункции

Функция ВернутьСтруктуруПеречисления(Ссылка) Экспорт
	Структура = Новый Структура;
	Структура.Вставить("type",Ссылка.Метаданные().Имя);
	Структура.Вставить("index",Перечисления[Ссылка.Метаданные().Имя].Индекс(Ссылка));
	Структура.Вставить("name",СокрЛП(Ссылка));
	
	Возврат Структура;
КонецФункции

Функция ПеречислениеПоСтруктуре(Структура) Экспорт
	Возврат Перечисления[Структура.type].Получить(Структура.index);
КонецФункции



