// Обработчик запросов метода GET ресурса /tasks_user
//	сервиса oas_api
// 
// В метод передается структура контекста входящего запроса (см. оас_Контекст), содержащая 
// 	Сервис - Строка - БазовыйURL запроса, равен КорневойURL сервиса
// 	Метод - Строка - HTTPМетод
// 	Ресурс - Строка - ОтносительныйURL запроса
// 	Точка - Строка - Ресурс спецификации (user/{username}, /order/{orderId}/update)
// 	Параметры - Соответствие - полученные по спецификации параметры
// 		<Ключ> - Строка - имя параметра
// 		Значение - Строка, Число - значение параметра
// 	Тело - Строка, ДвоичныеДанные - полученное по спецификации тело запроса
// 	Обработчик - Соответствие - полное имя и вызываемы метод обработчика ресурса по настройкам
// 		Имя - Строка - полное имя обработки
// 		Метод - Строка - имя вызываемого метода
// 
// BSLLS:NestedFunctionInParameters-off - без лишних переменных выполнение быстрее
// BSLLS:EmptyRegion-off - пустые области разрешены

#Область ОписаниеПеременных

#КонецОбласти


#Область ПрограммныйИнтерфейс

// Возвращает ответ по запросу GET ресурса /tasks_user
//	сервиса oas_api
//
// Параметры: 
//	guidUser - Строка - Обязательный, 
// 
// Тело запроса:
//	Текст, необязательное
//
// Возвращаемое значение: 
//	HTTPСервисОтвет 
// Схема ответа:
//	{
//		"200": {
//			"description": "OK",
//			"content": {
//				"application/json": {
//					"schema": {
//						"type": "array",
//						"items": {
//							"type": "object",
//							"properties": {
//								"date": {
//									"type": "string",
//									"format": "date-time"
//								},
//								"title": {
//									"type": "string"
//								},
//								"condition": {
//									"type": "string",
//									"description": "Состояние",
//									"enum": [
//										"appointed",
//										"received",
//										"progress",
//										"postponed",
//										"completed",
//										"resumed"
//									]
//								},
//								"importance": {
//									"type": "string",
//									"description": "Важность",
//									"enum": [
//										"base",
//										"low",
//										"high"
//									]
//								},
//								"partner": {
//									"description": "Ссылка на справочник",
//									"type": "object",
//									"properties": {
//										"guid": {
//											"type": "string",
//											"description": "Уникальный идентификатор"
//										},
//										"type": {
//											"type": "string",
//											"description": "Тип справочника"
//										},
//										"name": {
//											"type": "string",
//											"description": "Наименование справочника"
//										},
//										"code": {
//											"type": "string",
//											"description": "Код справочника"
//										}
//									}
//								},
//								"author": {
//									"description": "Ссылка на справочник",
//									"type": "object",
//									"properties": {
//										"guid": {
//											"type": "string",
//											"description": "Уникальный идентификатор"
//										},
//										"type": {
//											"type": "string",
//											"description": "Тип справочника"
//										},
//										"name": {
//											"type": "string",
//											"description": "Наименование справочника"
//										},
//										"code": {
//											"type": "string",
//											"description": "Код справочника"
//										}
//									}
//								},
//								"responsible": {
//									"description": "Ссылка на справочник",
//									"type": "object",
//									"properties": {
//										"guid": {
//											"type": "string",
//											"description": "Уникальный идентификатор"
//										},
//										"type": {
//											"type": "string",
//											"description": "Тип справочника"
//										},
//										"name": {
//											"type": "string",
//											"description": "Наименование справочника"
//										},
//										"code": {
//											"type": "string",
//											"description": "Код справочника"
//										}
//									}
//								},
//								"producer": {
//									"description": "Ссылка на справочник",
//									"type": "object",
//									"properties": {
//										"guid": {
//											"type": "string",
//											"description": "Уникальный идентификатор"
//										},
//										"type": {
//											"type": "string",
//											"description": "Тип справочника"
//										},
//										"name": {
//											"type": "string",
//											"description": "Наименование справочника"
//										},
//										"code": {
//											"type": "string",
//											"description": "Код справочника"
//										}
//									}
//								}
//							},
//							"description": "Элемент журнала задач"
//						}
//					}
//				}
//			}
//		}
//	}
//
Функция Ответ(Контекст) Экспорт
	
	Результат	= Неопределено;
	
	// Допустимы вызовы ТОЛЬКО в серверном контексте
	#Если Сервер Тогда
		
		Результат	= оас_Сервис.ПротоколОтвет(201);
		Тело		= оас_Контекст.Тело(Контекст);
			
				
		Структура = oas_anit.ПрочитатьСтрокуJSON(Тело);
		
		Документ = oas_anit.ВернутьДокументПоGuid("АН_Событие",Структура.guid).ПолучитьОбъект();
		
				
		Документ.Состояние = oas_anit.ПеречислениеПоСтруктуре(Структура.condition);
		Документ.Важность = oas_anit.ПеречислениеПоСтруктуре(Структура.importance);
		Документ.ОписаниеСобытия = Структура.title;

		Документ.Партнер = oas_anit.СправочникПоСтруктуре(Структура.partner);
		Документ.Автор = oas_anit.СправочникПоСтруктуре(Структура.author);
		Документ.Ответственный = oas_anit.СправочникПоСтруктуре(Структура.responsible);
		Документ.ПостановщикЗадачи = oas_anit.СправочникПоСтруктуре(Структура.producer);


		
		
		Документ.Записать();	
		
	#Иначе
		ВызватьИсключение оас_ПодсистемаТексты.СредаВыполненияОшибка();
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции // Ответ 

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#КонецОбласти

// BSLLS:EmptyRegion-on
// BSLLS:NestedFunctionInParameters-on