// Обработчик запросов метода GET ресурса /tasks_user
//	сервиса oas_api
// 
// В метод передается структура контекста входящего запроса (см. оас_Контекст), содержащая 
// 	Сервис - Строка - БазовыйURL запроса, равен КорневойURL сервиса
// 	Метод - Строка - HTTPМетод
// 	Ресурс - Строка - ОтносительныйURL запроса
// 	Точка - Строка - Ресурс спецификации (user/{username}, /order/{orderId}/update)
// 	Параметры - Соответствие - полученные по спецификации параметры
// 		<Ключ> - Строка - имя параметра
// 		Значение - Строка, Число - значение параметра
// 	Тело - Строка, ДвоичныеДанные - полученное по спецификации тело запроса
// 	Обработчик - Соответствие - полное имя и вызываемы метод обработчика ресурса по настройкам
// 		Имя - Строка - полное имя обработки
// 		Метод - Строка - имя вызываемого метода
// 
// BSLLS:NestedFunctionInParameters-off - без лишних переменных выполнение быстрее
// BSLLS:EmptyRegion-off - пустые области разрешены

#Область ОписаниеПеременных

#КонецОбласти


#Область ПрограммныйИнтерфейс

// Возвращает ответ по запросу GET ресурса /tasks_user
//	сервиса oas_api
//
// Параметры: 
//	guidUser - Строка - Обязательный, 
// 
// Тело запроса:
//	Текст, необязательное
//
// Возвращаемое значение: 
//	HTTPСервисОтвет 
// Схема ответа:
//	{
//		"200": {
//			"description": "OK",
//			"content": {
//				"application/json": {
//					"schema": {
//						"type": "array",
//						"items": {
//							"type": "object",
//							"properties": {
//								"date": {
//									"type": "string",
//									"format": "date-time"
//								},
//								"title": {
//									"type": "string"
//								},
//								"condition": {
//									"type": "string",
//									"description": "Состояние",
//									"enum": [
//										"appointed",
//										"received",
//										"progress",
//										"postponed",
//										"completed",
//										"resumed"
//									]
//								},
//								"importance": {
//									"type": "string",
//									"description": "Важность",
//									"enum": [
//										"base",
//										"low",
//										"high"
//									]
//								},
//								"partner": {
//									"description": "Ссылка на справочник",
//									"type": "object",
//									"properties": {
//										"guid": {
//											"type": "string",
//											"description": "Уникальный идентификатор"
//										},
//										"type": {
//											"type": "string",
//											"description": "Тип справочника"
//										},
//										"name": {
//											"type": "string",
//											"description": "Наименование справочника"
//										},
//										"code": {
//											"type": "string",
//											"description": "Код справочника"
//										}
//									}
//								},
//								"author": {
//									"description": "Ссылка на справочник",
//									"type": "object",
//									"properties": {
//										"guid": {
//											"type": "string",
//											"description": "Уникальный идентификатор"
//										},
//										"type": {
//											"type": "string",
//											"description": "Тип справочника"
//										},
//										"name": {
//											"type": "string",
//											"description": "Наименование справочника"
//										},
//										"code": {
//											"type": "string",
//											"description": "Код справочника"
//										}
//									}
//								},
//								"responsible": {
//									"description": "Ссылка на справочник",
//									"type": "object",
//									"properties": {
//										"guid": {
//											"type": "string",
//											"description": "Уникальный идентификатор"
//										},
//										"type": {
//											"type": "string",
//											"description": "Тип справочника"
//										},
//										"name": {
//											"type": "string",
//											"description": "Наименование справочника"
//										},
//										"code": {
//											"type": "string",
//											"description": "Код справочника"
//										}
//									}
//								},
//								"producer": {
//									"description": "Ссылка на справочник",
//									"type": "object",
//									"properties": {
//										"guid": {
//											"type": "string",
//											"description": "Уникальный идентификатор"
//										},
//										"type": {
//											"type": "string",
//											"description": "Тип справочника"
//										},
//										"name": {
//											"type": "string",
//											"description": "Наименование справочника"
//										},
//										"code": {
//											"type": "string",
//											"description": "Код справочника"
//										}
//									}
//								}
//							},
//							"description": "Элемент журнала задач"
//						}
//					}
//				}
//			}
//		}
//	}
//
Функция Ответ(Контекст) Экспорт
	
	Результат	= Неопределено;
	
	// Допустимы вызовы ТОЛЬКО в серверном контексте
	#Если Сервер Тогда
		
		Результат	= оас_Сервис.ПротоколОтвет(200);
		Тело		= оас_Контекст.Тело(Контекст);
		// Разворачиваем параметры в локальные переменные 
		Параметры	= оас_Контекст.Параметры(Контекст); 
		_type = Параметры.Получить("type");
		_offset = Число(Параметры.Получить("offset"));
		_count = Число(Параметры.Получить("count"));
		_search = Параметры.Получить("search");
		
		
		
		Запрос = Новый Запрос();
		Текст = "ВЫБРАТЬ
		|	Элементы.Ссылка КАК Ссылка,
		|	АВТОНОМЕРЗАПИСИ() КАК Номер
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	Справочник.ТИПСПРАВОЧНИКА КАК Элементы
		|ГДЕ
		|	Элементы.Наименование ПОДОБНО &Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.Ссылка КАК Ссылка,
		|	Данные.Номер КАК Номер
		|ИЗ
		|	Данные КАК Данные
		|ГДЕ
		|	Данные.Номер >= &Начало
		|	И Данные.Номер <= &Конец";
		
		Запрос.Текст = СтрЗаменить (Текст, "ТИПСПРАВОЧНИКА", _type);
		
		Запрос.Параметры.Вставить("Наименование","%" + _search + "%");
		Запрос.Параметры.Вставить("Начало",_offset + 1);
		Запрос.Параметры.Вставить("Конец",_offset + 1 +_count);

		Выборка = Запрос.Выполнить().Выбрать();
		Массив = Новый Массив;
		Пока Выборка.Следующий() Цикл						
			Массив.Добавить(oas_anit.ВернутьСтруктуруСсылкиСправочника(Выборка.Ссылка));
		КонецЦикла;
		

		CтрокаJSON = oas_anit.СтруктуруВjSON(Массив);
		Результат.УстановитьТелоИзСтроки(CтрокаJSON,КодировкаТекста.UTF8);

	#Иначе
		ВызватьИсключение оас_ПодсистемаТексты.СредаВыполненияОшибка();
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции // Ответ 

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#КонецОбласти

// BSLLS:EmptyRegion-on
// BSLLS:NestedFunctionInParameters-on